extends Node2D

func _ready():
	var inst = load("res://src/scene/dialogbox.tscn").instance()
	inst.set_text(get_text())
	add_child(inst)
	
	get_text()

func end_dialog():
	get_tree().change_scene("res://src/scene/chapter1.tscn")
	#queue_free()

func get_text():
	var data = set_text()
	return data

func set_text():
	var value = {
		"0":{
			"1":"กาลครั้งหนึ่งนานมาแล้ว ณ โลกที่ทุกอย่างตัดสินกันด้วยคณิตศาสตร์"
		},
		"1":{
			"1":"ไม่ว่าจะเป็นการต่อสู้ การตัดต้นไม้ การทดสอบต่างๆ ล้วนแล้วแต่ต้องใช้คณิตศาสตร์ในการตัดสินทั้งสิ้น"
		},
		"2":{
			"1":"และสิ่งมีชีวิตที่มีความเฉลียวฉลาด และมีทักษะในการแก้โจทย์ปัญหาทางคณิตศาสตร์มากที่สุดก็คือมนุษย์",
		},
		"3":{
			"1":"ด้วยเหตุนี้เองมนุษย์จึงเป็นผู้ที่อยู่บนจุดสูงสุดของห่วงโซ่อาหารของสิ่งมีชีวิตทั้งหมดบนโลกใบนี้"
		},
		"4":{
			"1":"มนุษย์ได้ทำการรวมกลุ่ม ปกครองกันเอง และจัดตั้งเป็นอาณาจักรเออรี่ขึ้นมา"
		},
		"5":{
			"1":"ไม่เพียงเท่านั้น มนุษย์นั้นได้ทำการบุกเบิกพื้นที่ส่วนต่างๆของโลกใบนี้ และได้สร้างสิ่งก่อสร้างต่างๆไว้มากมายเช่น เมือง ป้อมปราการ หมู่บ้าน"
		},
		"6":{
			"1":"ยุคทองของมนุษย์ได้เริ่มต้นขึ้น"
		},
		"7":{
			"1":"มนุษย์บนโลกใบนี้ใช้ชีวิตอย่างสงบสุข มีชีวิตที่เรียบง่าย และใช้ชีวิตอย่างมีความสุขในทุกๆวัน"
		},
		"8":{
			"1":"และแล้วฝันร้ายของมนุษย์ก็ได้เริ่มต้นขึ้น"
		},
		"9":{
			"1":"มีสิ่งมีชีวิตที่ทรงพลังและมีความเฉลียวฉลาดเทียบเท่าหรือมากกว่ามนุษย์กำเนิดขึ้นบนโลก"
		},
		"10":{
			"1":"มนุษย์เรียกสิ่งมีชีวิตนั้นว่า “ปีศาจ”"
		},
		"11":{
			"1":"พวกมันมีศักยภาพร่างกายที่สูงกว่ามนุษย์ทั่วไป และที่สำคัญพวกมันมีความเฉลียวฉลาดและทางคณิตศาสตร์ที่สูงมาก"
		},
		"12":{
			"1":"ปีศาจนั้นต้องการที่จะยึดครองโลกนี้ไว้ภายใต้การปกครองของจอมปีศาจคาราฮานผู้โหดเหี้ยม"
		},
		"13":{
			"1":"จึงเกิดสงความในการแย่งชิงดินแดนกันระหว่างมนุษย์และปีศาจ"
		},
		"14":{
			"1":"ผลการต่อสู้คือ ฝั่งมนุษย์พ่ายแพ้ และเสียดินแดนครึ่งหนึ่งไป นั้นคือฝั่งตะวันออกทั้งหมด"
		},
		"15":{
			"1":"สงครามระหว่างมนุษย์กับปีศาจนั้นได้ดำเนินไปอย่างต่อเนื่อง โดยมีเทือกเขาพลัมขั้นกลางระหว่าง 2 ฝั่ง"
		},
		"16":{
			"1":"เทือกเขาพลัมเป็นเทือกเขาที่มีความสูงชันมาก ไม่ว่ามนุษย์หรือปีศาจก็ไม่สามารถข้ามภูเขาลูกนี้ไปได้"
		},
		"17":{
			"1":"จึงทำให้สงครามนั้นเกิดขึ้นในบริเวณช่องแคบพลัม มนุษย์และปีศาจต่างก็จัดกองทัพของตนมาต่อสู้กับอีกฝ่าย"
		},
		"18":{
			"1":"แต่ฝ่ายของมนุษย์นั้นเสียเปรียบเป็นอย่างมาก เนื่องจากปีศาจมีร่างกายที่แข็งแรงกว่า ทั้งยังมีสติปัญญาที่เทียบเท่าหรือสูงกว่ามนุษย์"
		},
		"19":{
			"1":"สงครามระหว่างมนุษย์กับปีศาจจะจบอย่างไร . . . "
		},
		"20":{
			"1":"นี้คือเรื่องราวของเกอราชกับสงครามโลกคณิตศาสตร์ จากช่างตัดไม้ธรรมดาๆสู่การเป็นผู้จบสงครามโลกคณิตศาสตร์"
		},
		"21":{
			"1":"เกอราชนั้นเป็นเพียงช่างตัดไม้ธรรมดาที่อาศัยอยู่ในป่าของหมู่บ้านทางตอนใต้ เขาใช้ชีวิตอย่างมีความสุข และสงบสุขในป่าและธรรมชาติ"
		},
		"22":{
			"1":"และแล้วเกอราชก็ต้องพบเจอกับเหตุการณ์ที่เปลี่ยนแปลงชีวิตเขาไปตลอดกาล . . ."
		}
	}
	return value
